#  При открытии вклада в банке установлены следующие годовые проценты: при
# вкладе до 50000р. процент составит 4%; при вкладе от 50000р. до 100000р. процент
# составит 5%; при вкладе от 100000р. до 150000р. скидка составит 6%; при вкладе от
# 150000 р. до 200000 р. процент составит 7%. Составить программу, определяющую
# процентной ставки в зависимости от вносимой суммы

while True:
    try:
        X = int(input("Введите сумму вашего вклада: "))

        if X <= 0:
            print("Сумма вклада не может быть равна нулю")
            exit()
        elif X <= 49999:
            print("Ваша процентная ставка 4%")
        elif X <= 99999:
            print("Ваша процентная ставка 5%")
        elif X <= 149999:
            print("Ваша процентная ставка 6%")
        elif X >= 150000:
            print("Ваша процентная ставка 7%")

    except ValueError:
        print("Нужно вводить целые числа")
